//Циклы в JavaScript — while, do while и for. Прерывание цикла break. Продолжение цикла continue.

/* ____________________________________________________________________________________________________ */

// function renderMenuItem(menuItem){}

// const menuItems = [
//     'Главня',
//     'Каталог',
//     'Контакты',
//     'О нас',
// ]

// for (let i = 0; i < menuItems.length; i++) {
//     renderMenuItem(menuItems[i])
// }

// /* =========== */

// let password = ''

// while (password.length < 8) {
//     password = prompt('Введите пароль  (не менее 8 символов)')
// }

// console.log(`Ваш пароль: ${password}`)

/* ____________________________________________________________________________________________________ */

// let count = 0

// while (count < 10) {
//     console.log(count)
//     count++
// }

/* ____________________________________________________________________________________________________ */

// let count = 100

// do {
//     console.log(count)
//     count++
// } while (count < 10){
// }

/* ____________________________________________________________________________________________________ */

// for (let i = 0; i < 4; i++){
//     alert(`i = ${i}`)
// }

/* ____________________________________________________________________________________________________ */

// let count = 1

// console.log('Цикл сейча начнется')

// while (count < 10) {
//     console.log(count)
    
//     if (count % 5 === 0) {
//         console.log('Цикл прерван досрочно')
//         break
//     }
//     count++
// }

// console.log('...цикл закончен!')

/* ____________________________________________________________________________________________________ */

console.log('Цикл сейчас начнется...')

for (let i = 0; i < 10; i++){
    if (i % 2 === 0){
        continue
    }
    console.log(i)
}

console.log('...цикл закончен!')