//Объекты в JavaScript. Свойства объекта — чтение, добавление, удаление, проверка наличия и перебор.

/*__________________________________________________________________________________________*/

// const name = 'Макс'
// const age = 28
// const isDeveloper = false
// const power = 666n
// const sign = Symbol()
// const something = undefined
// const data = null

// const user = {
//     login: '123',
//     password: 'qwerty,'
// }

/*__________________________________________________________________________________________*/

// const firsEmptyObject = {}
// const secondEmptyObject = new Object()

/*__________________________________________________________________________________________*/

// const user = {
//     login: 'iamsuperhero',
//     password: 'qwerty', 
//     'registration date': '01.01.2024',
//     'last-auth': '05.04.2024',
// }

//Если в ключе есть пробел или -, необходимо указывать его в кавычках '' или ""
/*____________________________________________________________*/

// const user = {
//     login: 'iamsuperhero',
//     password: 'qwerty', 
//     'registration date': '01.01.2024',
//     'last-auth': '05.04.2024',

//     age: 33,
//     isAdult: true,
//     job: null,
//     kids: undefined,
//     address: {
//         city: 'Москва',
//         zipCode: 555444,
//     },
//     sayHi: () => console.log('Привет!'),
// }

/*____________________________________________________________*/

// const admin = {level: 10, status: 'online'}

/*____________________________________________________________*/

// const user = {
//     login: 'iamsuperhero',
//     password: 'qwerty', 
//     'registration date': '01.01.2024',
//     'last-auth': '05.04.2024',

//     age: 33,
//     isAdult: true,
//     job: null,
//     kids: undefined,
//     address: {
//         city: 'Москва',
//         zipCode: 555444,
//     },
//     sayHi: () => console.log('Привет!'),
// }

// console.log(user.login)
// console.log(user['login'])
// console.log(user['registration date'])
// user.sayHi()

/*____________________________________________________________*/

// const user = {}

// user.name = 'Макс'
// user['is developer'] = false
// user.name = 'Макс?'

// console.log(user)

// delete user.name

// console.log(user)

/*____________________________________________________________*/

// const name = 'Макс'
// const age = 27

// const user = {
//     name: name,
//     age: age,
// }

// console.log(user)

//эквивалетно

// const name = 'Макс'
// const age = 27

// const user = {
//     name,
//     age,
// }

// console.log(user)
/*____________________________________________________________*/

// const propName = prompt('Свойство с каким именем доабвить в объект?')
// const propValue = prompt(  `Какое значение записать в свойство ${propName}`)

// const obj = {
//     [propName]: propValue,
// }

// console.log(obj)
/*____________________________________________________________*/

// const user = {
//     name: 'Макс',
//     age: '27',
// }

// console.log('isDeveloper' in user) //Для проверки свойства объекта

/*____________________________________________________________*/

// const user = {
//     name: 'Макс',
//     age: '27',
// }

// for (let i in user){
//     console.log(i)
//     console.log(user[i])
// }


const nums = {
    name: 'Макс',
    2: 'Второй',
    1: 'Первый',
    3: 'Третий',
    age: 27,
}

for (const num in nums){
    console.log(nums[num])
}

// При соритровке сначала сортирует по объектам, которые можно в числа преобразовать. Потом все остальное
/*____________________________________________________________*/



/*____________________________________________________________*/


/*____________________________________________________________*/


/*____________________________________________________________*/



/*____________________________________________________________*/



/*____________________________________________________________*/



/*____________________________________________________________*/



/*____________________________________________________________*/


/*____________________________________________________________*/


/*____________________________________________________________*/



/*____________________________________________________________*/



/*____________________________________________________________*/



/*____________________________________________________________*/



/*____________________________________________________________*/


/*____________________________________________________________*/


/*____________________________________________________________*/



/*____________________________________________________________*/



/*____________________________________________________________*/



/*____________________________________________________________*/



/*____________________________________________________________*/
